In [122]:
import numpy as np
import pandas as pd

In [99]:
data = pd.read_csv("Salary_Data.xls")

In [100]:
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [101]:
data.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [102]:
df = data.dropna(axis=0)
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [103]:
#X=np.array(df['YearsExperience']).reshape(-1,1)
X=df.drop(columns='Salary', axis=1)
X.head()

   YearsExperience
0              1.1
1              1.3
2              1.5
3              2.0
4              2.2

In [104]:
#y=np.array(df['Salary']).reshape(-1,1)
y=df['Salary']
y.head()

0    39343.0
1    46205.0
2    37731.0
3    43525.0
4    39891.0
Name: Salary, dtype: float64

In [105]:
# X = df.iloc[:,:-1]
# y = df.iloc[:,-1]

In [106]:
from sklearn.model_selection import train_test_split 
train_X, test_X, train_y, test_y = train_test_split(X, y, train_size=0.8, test_size=0.2, random_state=0)

In [107]:
from sklearn.linear_model import LinearRegression
salary_model=LinearRegression()
salary_model.fit(train_X, train_y)
print(salary_model.score(test_X, test_y))

0.988169515729126

In [111]:
y_predictions=salary_model.predict(test_X)
y_predictions

array([ 40748.96184072, 122699.62295594,  64961.65717022,  63099.14214487,
       115249.56285456, 107799.50275317])

In [112]:
test_y

2      37731.0
28    122391.0
13     57081.0
10     63218.0
26    116969.0
24    109431.0
Name: Salary, dtype: float64

In [125]:
test_X

    YearsExperience
2               1.5
28             10.3
13              4.1
10              3.9
26              9.5
24              8.7

In [109]:
from sklearn.metrics import r2_score
from sklearn.metrics import mean_squared_error

In [114]:
score=r2_score(test_y, y_predictions)
score

0.988169515729126

In [118]:
mse=mean_squared_error(test_y, y_predictions)
rmse=np.sqrt(mse)
rmse

3580.979237321337

In [121]:
from sklearn.metrics import mean_absolute_error
mae=mean_absolute_error(y_predictions, test_y)
mae

2446.172369046503